ТСД_файловая/src/InformationRegisters/ДанныеВРаботе/ДанныеВРаботе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВРаботе</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СканированиеТовар</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СканированиеЦенник</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЕдиницы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспМРЦ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пересчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПревышенОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРасхождение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВведено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПроверена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпецЦена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЦенник</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРасхожденияПорядок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРасхожденияСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПоставщика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРасхождения</name>
    <type>
      <types>EnumRef.ПричиныРасхождения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументUUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипыДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>МРЦ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ТСД_файловая/src/InformationRegisters/ДанныеВРаботе/ManagerModule.bsl
Функция ЕстьДанныеВРаботе(ДокументUUID,ТипДокумента)Экспорт
	
	флВозврат = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.ДанныеВРаботе КАК ДанныеВРаботе
		|ГДЕ
		|	ДанныеВРаботе.ДокументUUID = &ДокументUUID
		|	И ДанныеВРаботе.ТипДокумента = &ТипДокумента";
	
	Запрос.УстановитьПараметр("ДокументUUID", ДокументUUID);
	Запрос.УстановитьПараметр("ТипДокумента", ТипДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		флВозврат = Ложь;
	КонецЕсли;
	Возврат флВозврат;
КонецФункции

Процедура ОчиститьДанныеВРаботе(ДокументUUID,ТипДокумента)Экспорт
	
	Если ДокументЗаписываетДанныеВРегистр(ТипДокумента) Тогда
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.ДокументUUID.Установить(ДокументUUID);
		Набор.Отбор.ТипДокумента.Установить(ТипДокумента);
		
		Набор.Записать();
		
	КонецЕсли;

КонецПроцедуры

Функция ДокументЗаписываетДанныеВРегистр(ТипДокумента) 

	Если  ТипДокумента = Справочники.ТипыДокументов.ЗаданиеТБД 
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ЗаданиеИН 
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ЗаданиеТНП 
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ПеремещениеТоваров
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ЗаданиеВФ
		ИЛИ ТипДокумента = Справочники.ТипыДокументов.ПриемПоЗаказу Тогда   
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

	

Процедура ДобавитьЗапись(ТекСтрока)Экспорт
	
	Если  ДокументЗаписываетДанныеВРегистр(ТекСтрока.ТипДокумента) Тогда
		
		Набор = РегистрыСведений.ДанныеВРаботе.СоздатьНаборЗаписей();
		Набор.Отбор.ДокументUUID.Установить(ТекСтрока.ДокументUUID);
		Набор.Отбор.ТипДокумента.Установить(ТекСтрока.ТипДокумента);
		Набор.Отбор.Артикул.Установить(ТекСтрока.Артикул);
		Набор.Отбор.МРЦ.Установить(ТекСтрока.МРЦ);
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись,ТекСтрока);
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры
